       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLEDPGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LS-NUM1 PIC 9(2).
       01 LS-NUM2 PIC 9(2).
       PROCEDURE DIVISION USING LS-NUM1, LS-NUM2.
       MAIN-PROCEDURE.
           DISPLAY "IN CALLED PROGRAM".
           MOVE 88 TO LS-NUM1.
           MOVE 56 TO LS-NUM2.
           DISPLAY 'LS-NUM1:' LS-NUM1.
           DISPLAY 'LS-NUM2:' LS-NUM2.
           EXIT PROGRAM.
