       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLINGPGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUM1 PIC 9(2) VALUE 99.
       01 WS-NUM2 PIC 9(2) VALUE 72.
       01 WS-ADD PIC 9(3).
       01 WS-PGM PIC X(9).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY 'IN CALLING MODULE'.
           DISPLAY 'WS-NUM1:' WS-NUM1.
           DISPLAY 'WS-NUM2:' WS-NUM2.
           COMPUTE WS-ADD = WS-NUM1 + WS-NUM2.
           DISPLAY 'WS-ADD:' WS-ADD.
           MOVE 'CALLEDPGM' TO WS-PGM.
           CALL WS-PGM USING WS-NUM1, WS-NUM2.
           DISPLAY 'IN CALLING MODULE'
           ADD WS-NUM1 TO WS-NUM2 GIVING WS-ADD.
           DISPLAY 'WS-NUM1:' WS-NUM1.
           DISPLAY 'WS-NUM2:' WS-NUM2.
           DISPLAY 'WS-ADD:' WS-ADD.
           STOP RUN.
